{"basics":{"name":"Abdullah Arshad","label":"Computer Science Graduate","image":"","email":"abdullaharshad2409@gmail.com","phone":"+92 316-4309346","url":"https://Abdullah-Arshad.github.io","summary":"Computer Science graduate from LUMS with research interests in AI/ML, LLM systems, and distributed systems. Experienced in developing AI-powered applications and conducting research in multimodal machine learning and natural language processing.","location":{"address":"","postalCode":"","city":"Lahore","countryCode":"PK","region":"Punjab"},"profiles":[]},"work":[{"name":"SensAI – AI Physician Assistant Platform","position":"Lead Developer","url":"","startDate":"2025-09-01","endDate":"","summary":"Building SensAI, an AI-powered medical scribing platform that converts multilingual doctor–patient conversations into structured notes, problem lists, ICD-10 codes, and order sets, reducing documentation burden for physicians in Pakistan and the United States.","highlights":["Designed the system architecture and SRS for five core modules — Notetaking, Porus (clinical chatbot), Yoda (LLM query engine), Avatar (3D risk visualization), and Wenhsiu (assessment workspace)","Authored detailed workflows and UI states for Allergies, Medications, Social History, Habits, and OBGYN bins","Specified functional and non-functional requirements for core infrastructure features like Pause, offline cache, secure offline mode, and model status indicators to ensure HIPAA/GDPR-aligned handling","Translated clinician feedback and edge cases into testable acceptance criteria and audit-friendly logging behavior"]},{"name":"Lahore University of Management Sciences","position":"Teaching Assistant (CS-100: Introduction to Computing)","url":"https://lums.edu.pk/","startDate":"2023-09-01","endDate":"2024-12-31","summary":"Conducted tutorials, held office hours, and graded assignments for over 200 students each semester.","highlights":["Guided students through fundamental programming concepts and problem-solving techniques in C++"]},{"name":"SPADES - Lahore University of Management Sciences","position":"Head of IT Department","url":"","startDate":"2023-02-01","endDate":"2024-01-31","summary":"Led the front-end development team and supervised the design and implementation of the main SPADES website.","highlights":["Assigned projects and monitored team progress to ensure timely and high-quality deliverables","Conducted workshops on front-end development, focusing on HTML, CSS, and JavaScript"]},{"name":"Self-Employed","position":"Private Tutor","url":"","startDate":"2022-01-01","endDate":"","summary":"Taught programming languages (Java, Python, C++) to A-level and university-level students.","highlights":["Prepared students for academic success by providing tailored lessons and hands-on coding exercises","Mentored students on best practices in software development and problem-solving techniques"]}],"volunteer":[],"education":[{"institution":"Lahore University of Management Sciences (LUMS)","location":"Lahore, Pakistan","url":"https://lums.edu.pk/","area":"Computer Science","studyType":"Bachelor of Science","startDate":"2021-09-01","endDate":"2025-06-30","score":"","courses":["Artificial Intelligence","Computer Networks","Distributed Systems","LLM Systems","Machine Learning","Generative AI","Operating Systems","Software Engineering"]}],"awards":[{"title":"High Achiever in O Levels","date":"2018-01-01","awarder":"","url":"","summary":"Recognized as a High Achiever for securing 13 A*/A grades in O Levels"},{"title":"100% Merit-Based Scholarship for A Levels","date":"2018-01-01","awarder":"","url":"","summary":"Awarded a 100% merit-based scholarship for the entire duration of A Levels"}],"certificates":[],"publications":[],"skills":[{"name":"Programming Languages","level":"Advanced","icon":"fa-solid fa-code","keywords":["Java","Python","C","C++","SQL (PostgreSQL)","JavaScript","HTML/CSS","R"]},{"name":"Frameworks and Tools","level":"Advanced","icon":"fa-solid fa-toolbox","keywords":["React","Node.js","Flask","FastAPI","WordPress","Material-UI","JUnit"]},{"name":"Developer Tools","level":"Advanced","icon":"fa-solid fa-laptop-code","keywords":["Git","Docker","TravisCI","Google Cloud Platform (GCP)","VS Code","PyCharm","IntelliJ","Eclipse"]},{"name":"Libraries and Packages","level":"Advanced","icon":"fa-solid fa-book","keywords":["pandas","NumPy","Matplotlib","SciKit-Learn"]}],"languages":[{"language":"English","fluency":"Fluent","icon":""},{"language":"Urdu","fluency":"Native speaker","icon":""},{"language":"Punjabi","fluency":"Native speaker","icon":""}],"interests":[{"name":"Research","icon":"fa-solid fa-microscope","keywords":["AI/ML","LLM Systems","Distributed Systems","Multimodal Learning","Natural Language Processing"]}],"references":[],"projects":[{"name":"Multimodal Prediction of Anxiety/Depression Using LLMs","summary":"Developed a framework leveraging LLMs to predict anxiety and depression using Urdu audio inputs. Focused on integrating multimodal data and designing predictive systems for underrepresented linguistic demographics.","highlights":["Built a pipeline for preprocessing audio data, extracting features, and training models"],"startDate":"2024-09-01","endDate":"","url":""},{"name":"Mental Health Assessment Using Patient Records in Zanjabee Dataset","summary":"Conducted research to predict anxiety and depression using anonymized patient data stored in PDF format.","highlights":["Designed and implemented methods to extract, preprocess, and analyze clinical data for model training","Applied OCR and natural language processing techniques to extract relevant text from scanned PDF files"],"startDate":"2024-09-01","endDate":"","url":""},{"name":"Utilising LLMs for Streamlined Analysis of PTA Datasets","summary":"Designed a pipeline for analyzing PTA datasets using GPT-4, achieving a 96.8% accuracy improvement through PDF splitting and JSON structuring.","highlights":["Applied advanced prompt engineering (Few-Shot and Chain-of-Thought) to extract insights for broadband benchmarking and KPI-based recommendations","Proposed frameworks for integrating LLM-based dashboards to enhance telecom policy decision-making"],"startDate":"2024-01-01","endDate":"2024-06-30","url":""},{"name":"Detecting Political Polarization in News Channels Using LLMs","summary":"Developed a methodology using multimodal LLMs to analyze political polarization in video content, focusing on textual, visual, and auditory features.","highlights":["Implemented segmentation techniques to improve analysis of framing, emotional tone, and screen time allocation in news bulletins and talk shows","Achieved high inter-rater accuracy (0.98) across 9 videos, enhancing the reliability of bias detection","Explored Few-Shot prompting techniques to improve the granularity of insights"],"startDate":"2024-09-01","endDate":"2024-12-31","url":""},{"name":"CS100 Virtual Teaching Assistant","summary":"Developed a virtual teaching assistant tailored for CS-100 students at LUMS to provide coding guidance, evaluate solutions, and offer reinforcement exercises.","highlights":["Implemented features such as sanity and sufficiency checks, problem-solving guidance, and quizzes, focusing on C++ and aligning with the course curriculum"],"startDate":"2024-01-01","endDate":"2024-12-31","url":""},{"name":"Content Moderation and Toxicity Classification","summary":"Built a machine learning pipeline to classify toxic content (e.g., threats, insults, identity hate) using the Jigsaw Toxic Comment Dataset.","highlights":["Leveraged models like Logistic Regression, RNNs, and Transformer-based architectures (BERT, DeBERTa)","Designed preprocessing workflows and implemented Transformers for feature extraction and model training, achieving high accuracy in toxicity detection"],"startDate":"2024-01-01","endDate":"2024-12-31","url":""},{"name":"Distributed Key-Value Store","summary":"Implemented a distributed, fault-tolerant key-value store supporting leader elections and log replication with persistence using Golang.","highlights":[],"startDate":"2024-01-01","endDate":"2024-12-31","url":""},{"name":"KIYA - Succession Planning System","summary":"Developed a web application for automated employee succession planning based on promotion criteria using MERN Stack.","highlights":[],"startDate":"2024-01-01","endDate":"2024-12-31","url":""},{"name":"Command-line Shell","summary":"Created a shell in C capable of handling conjugated commands and pipelining.","highlights":[],"startDate":"2023-01-01","endDate":"2023-12-31","url":""}]}